#ifndef DRAM_H
#define DRAM_H

//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include <stdint.h>
#include <stdbool.h>

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------

void DRAM_Init(void);//инициализация памяти
void DRAM_Refresh(void);//произвести цикл скрытой регенерации
uint8_t DRAM_ReadNibble(uint32_t addr,bool nibble_one);//считать ниббл
void DRAM_WriteNibble(uint32_t addr,uint8_t nibble,bool nibble_one);//записать ниббл
uint8_t DRAM_ReadByte(uint32_t addr);//считать байт
void DRAM_WriteByte(uint32_t addr,uint8_t byte);//записать байт

#endif
