#ifndef SD_H
#define SD_H

//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include <stdbool.h>
#include <stdint.h>

//----------------------------------------------------------------------------------------------------
//прототипы функций
//----------------------------------------------------------------------------------------------------
void SD_Init(void);//инициализация карты памяти
bool SD_SendCommand(uint8_t cmd,uint8_t b0,uint8_t b1,uint8_t b2,uint8_t b3,uint8_t answer_size,uint8_t *answer);//послать команду и получить ответ от SD-карты
bool SD_GetSize(uint32_t *size);//получить объём SD-карты в байтах
bool SD_BeginReadBlock(uint32_t BlockAddr);//начать чтение блока
bool SD_ReadBlockByte(uint8_t *byte);//считать байт блока
bool SD_ReadBlock(uint32_t BlockAddr,uint8_t *Addr,bool first);//считать блок в 256 байт в память

#endif