#ifndef WH1602_H
#define WH1602_H

//----------------------------------------------------------------------------------------------------
//подключаемые библиотеки
//----------------------------------------------------------------------------------------------------
#include <stdint.h>
#include <stdbool.h>

//----------------------------------------------------------------------------------------------------
//протитипы функций
//----------------------------------------------------------------------------------------------------

void WH1602_Init(void);//инициализация дисплея
void WH1602_SetTextUpLine(char *text);//записать текст в верхнюю строчку экрана
void WH1602_SetTextDownLine(char *text);//записать текст в нижнюю строчку экрана
void WH1602_SetTextProgmemUpLine(const char *text);//записать текст из памяти в верхнюю строчку экрана
void WH1602_SetTextProgmemDownLine(const char *text);//записать текст из памяти в нижнюю строчку экрана

#endif